app/Controllers/Login.php

INSERT INTO `login` (`email`, `password`, `login_time`, `logout_time`) VALUES ('leo@gmail.com', 'admin123', '2025-08-09 11:00:00', '2025-07-09 12:00:00')
---
    public function create()
    {
        $data = $this->request->getJSON();

        if (!$data) {
            return $this->fail('Invalid JSON');
        }

        $this->model->insert([
            'email' => $data->email,
            'password'  => $data->password,
            'login_time' => $data->login_time,
            'logout_time'  => $data->logout_time
        ]);

UPDATE `login` SET `email` = 'cr7@gmail.com', `password` = 'siuuu', `login_time` = '2025-06-07 09:00:00', `logout_time` = '2025-07-09 10:00:00'
WHERE `login`.`id` IN ('7')
---
    public function update($id = null)
    {
        $data = $this->request->getJSON();

        if (!$data) {
            return $this->fail('Invalid JSON');
        }

        $updated = $this->model->update($id, [
            'email' => $data->email,
            'password'  => $data->password,
            'login_time' => $data->login_time,
            'logout_time'  => $data->logout_time
        ]);