app/Controllers/Ruangan.php

INSERT INTO `ruangan` (`nama_ruangan`, `kapasitas`, `lokasi`) VALUES ('BAAK', '20', 'Gedung A')
---
    public function create()
    {
        $data = $this->request->getJSON();

        if (!$data) {
            return $this->fail('Invalid JSON');
        }

        $this->model->insert([
            'nama_ruangan' => $data->nama_ruangan,
            'kapasitas'  => $data->kapasitas,
            'lokasi'      => $data->lokasi
        ]);